{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "Conv_1_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 201, 201, 3], "dtype": "float32", "sparse": false, "name": "Conv_1_input"}, "inbound_nodes": []}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "function": ["4wMAAAAAAAAACgAAAAQAAABTAAAAc4YAAAB0AGoBfACDAX0DfANkAGQBhQIZAH0EfANkAWQAhQIZ\nAH0FfAR8AhoAfQZ8AXwCZAEYAGsCckR8BHwGfAEUABgAfQduBHwGfQd0AGoCfAd8BWcCZAJkA40C\nfQd0AGoCfAZ8BWQCFABnAmQCZAONAn0IfAh8ARQAfQl0AGoDfAB8CXwHgwNTACkETukBAAAA6QAA\nAAApAdoEYXhpcykE2gFL2gVzaGFwZdoLY29uY2F0ZW5hdGXaBXNsaWNlKQraBGRhdGHaAWnaBXBh\ncnRzcgUAAADaCmJhdGNoX3NpemXaC2lucHV0X3NoYXBl2gRzdGVw2gRzaXpl2gZzdHJpZGXaBXN0\nYXJ0qQByEQAAAPptL2Rsc19zdy9hcHBzL3B5dGhvbi9hbmFjb25kYS8xLjcuMC82NC9lbnZzL3B5\ndGhvbjMvbGliL3B5dGhvbjMuNi9zaXRlLXBhY2thZ2VzL2tlcmFzL3V0aWxzL211bHRpX2dwdV91\ndGlscy5wedoJZ2V0X3NsaWNltgAAAHMWAAAAAAEKAQwBDAEIAQwBDgIEARIBFgEIAQ==\n", null, null], "function_type": "lambda", "output_shape": [201, 201, 3], "output_shape_type": "raw", "arguments": {"i": 0, "parts": 4}}, "inbound_nodes": [[["Conv_1_input", 0, 0, {}]]]}, {"name": "lambda_2", "class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "function": ["4wMAAAAAAAAACgAAAAQAAABTAAAAc4YAAAB0AGoBfACDAX0DfANkAGQBhQIZAH0EfANkAWQAhQIZ\nAH0FfAR8AhoAfQZ8AXwCZAEYAGsCckR8BHwGfAEUABgAfQduBHwGfQd0AGoCfAd8BWcCZAJkA40C\nfQd0AGoCfAZ8BWQCFABnAmQCZAONAn0IfAh8ARQAfQl0AGoDfAB8CXwHgwNTACkETukBAAAA6QAA\nAAApAdoEYXhpcykE2gFL2gVzaGFwZdoLY29uY2F0ZW5hdGXaBXNsaWNlKQraBGRhdGHaAWnaBXBh\ncnRzcgUAAADaCmJhdGNoX3NpemXaC2lucHV0X3NoYXBl2gRzdGVw2gRzaXpl2gZzdHJpZGXaBXN0\nYXJ0qQByEQAAAPptL2Rsc19zdy9hcHBzL3B5dGhvbi9hbmFjb25kYS8xLjcuMC82NC9lbnZzL3B5\ndGhvbjMvbGliL3B5dGhvbjMuNi9zaXRlLXBhY2thZ2VzL2tlcmFzL3V0aWxzL211bHRpX2dwdV91\ndGlscy5wedoJZ2V0X3NsaWNltgAAAHMWAAAAAAEKAQwBDAEIAQwBDgIEARIBFgEIAQ==\n", null, null], "function_type": "lambda", "output_shape": [201, 201, 3], "output_shape_type": "raw", "arguments": {"i": 1, "parts": 4}}, "inbound_nodes": [[["Conv_1_input", 0, 0, {}]]]}, {"name": "lambda_3", "class_name": "Lambda", "config": {"name": "lambda_3", "trainable": true, "function": ["4wMAAAAAAAAACgAAAAQAAABTAAAAc4YAAAB0AGoBfACDAX0DfANkAGQBhQIZAH0EfANkAWQAhQIZ\nAH0FfAR8AhoAfQZ8AXwCZAEYAGsCckR8BHwGfAEUABgAfQduBHwGfQd0AGoCfAd8BWcCZAJkA40C\nfQd0AGoCfAZ8BWQCFABnAmQCZAONAn0IfAh8ARQAfQl0AGoDfAB8CXwHgwNTACkETukBAAAA6QAA\nAAApAdoEYXhpcykE2gFL2gVzaGFwZdoLY29uY2F0ZW5hdGXaBXNsaWNlKQraBGRhdGHaAWnaBXBh\ncnRzcgUAAADaCmJhdGNoX3NpemXaC2lucHV0X3NoYXBl2gRzdGVw2gRzaXpl2gZzdHJpZGXaBXN0\nYXJ0qQByEQAAAPptL2Rsc19zdy9hcHBzL3B5dGhvbi9hbmFjb25kYS8xLjcuMC82NC9lbnZzL3B5\ndGhvbjMvbGliL3B5dGhvbjMuNi9zaXRlLXBhY2thZ2VzL2tlcmFzL3V0aWxzL211bHRpX2dwdV91\ndGlscy5wedoJZ2V0X3NsaWNltgAAAHMWAAAAAAEKAQwBDAEIAQwBDgIEARIBFgEIAQ==\n", null, null], "function_type": "lambda", "output_shape": [201, 201, 3], "output_shape_type": "raw", "arguments": {"i": 2, "parts": 4}}, "inbound_nodes": [[["Conv_1_input", 0, 0, {}]]]}, {"name": "lambda_4", "class_name": "Lambda", "config": {"name": "lambda_4", "trainable": true, "function": ["4wMAAAAAAAAACgAAAAQAAABTAAAAc4YAAAB0AGoBfACDAX0DfANkAGQBhQIZAH0EfANkAWQAhQIZ\nAH0FfAR8AhoAfQZ8AXwCZAEYAGsCckR8BHwGfAEUABgAfQduBHwGfQd0AGoCfAd8BWcCZAJkA40C\nfQd0AGoCfAZ8BWQCFABnAmQCZAONAn0IfAh8ARQAfQl0AGoDfAB8CXwHgwNTACkETukBAAAA6QAA\nAAApAdoEYXhpcykE2gFL2gVzaGFwZdoLY29uY2F0ZW5hdGXaBXNsaWNlKQraBGRhdGHaAWnaBXBh\ncnRzcgUAAADaCmJhdGNoX3NpemXaC2lucHV0X3NoYXBl2gRzdGVw2gRzaXpl2gZzdHJpZGXaBXN0\nYXJ0qQByEQAAAPptL2Rsc19zdy9hcHBzL3B5dGhvbi9hbmFjb25kYS8xLjcuMC82NC9lbnZzL3B5\ndGhvbjMvbGliL3B5dGhvbjMuNi9zaXRlLXBhY2thZ2VzL2tlcmFzL3V0aWxzL211bHRpX2dwdV91\ndGlscy5wedoJZ2V0X3NsaWNltgAAAHMWAAAAAAEKAQwBDAEIAQwBDgIEARIBFgEIAQ==\n", null, null], "function_type": "lambda", "output_shape": [201, 201, 3], "output_shape_type": "raw", "arguments": {"i": 3, "parts": 4}}, "inbound_nodes": [[["Conv_1_input", 0, 0, {}]]]}, {"name": "mapmodel_1", "class_name": "MapModel", "config": [{"class_name": "Conv2D", "config": {"name": "Conv_1", "trainable": true, "batch_input_shape": [null, 201, 201, 3], "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "Pool_1", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "Conv_2", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "Pool_2", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.75, "noise_shape": null, "seed": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"name": "Dense_1", "trainable": true, "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.15000000596046448}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "predictions", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}], "inbound_nodes": [[["lambda_1", 0, 0, {}]], [["lambda_2", 0, 0, {}]], [["lambda_3", 0, 0, {}]], [["lambda_4", 0, 0, {}]]]}, {"name": "predictions", "class_name": "Concatenate", "config": {"name": "predictions", "trainable": true, "axis": 0}, "inbound_nodes": [[["mapmodel_1", 1, 0, {}], ["mapmodel_1", 2, 0, {}], ["mapmodel_1", 3, 0, {}], ["mapmodel_1", 4, 0, {}]]]}], "input_layers": [["Conv_1_input", 0, 0]], "output_layers": [["predictions", 0, 0]]}, "keras_version": "2.2.0", "backend": "tensorflow"}